app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers` ORDER BY `customers`.`name` ASC
---
  def index
    @customers = Customer.all
    @customers = @customers.search_by_name(params[:search_name])
    @customers = @customers.search_by_email(params[:search_email])
    @customers = @customers.search_by_company(params[:search_company])
    @customers = @customers.order(:name)