app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY `products`.`name` ASC
---
  def index
    @products = Product.all
    @products = @products.search_by_name(params[:search_name])
    @products = @products.search_by_category(params[:search_category])
    @products = @products.search_by_sku(params[:search_sku])

    case params[:stock_filter]
    when "in_stock"
      @products = @products.in_stock
    when "out_of_stock"
      @products = @products.out_of_stock
    end

    case params[:status_filter]
    when "active"
      @products = @products.active
    when "inactive"
      @products = @products.inactive
    end

    @products = @products.order(:name)