app/controllers/staffs_controller.rb

SELECT `staffs`.* FROM `staffs` ORDER BY `staffs`.`name` ASC
SELECT `stores`.* FROM `stores` ORDER BY `stores`.`name` ASC
---
  def index
    @staffs = Staff.includes(:store).all
    @staffs = @staffs.search_by_name(params[:search_name])
    @staffs = @staffs.search_by_employee_id(params[:search_employee_id])
    @staffs = @staffs.search_by_position(params[:search_position])
    @staffs = @staffs.search_by_department(params[:search_department])
    @staffs = @staffs.by_store(params[:store_filter])

    case params[:status_filter]
    when "active"
      @staffs = @staffs.active
    when "inactive"
      @staffs = @staffs.inactive
    end

    @staffs = @staffs.order(:name)