app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores` ORDER BY `stores`.`name` ASC
---
  def index
    @stores = Store.all
    @stores = @stores.search_by_name(params[:search_name])
    @stores = @stores.search_by_address(params[:search_address])
    @stores = @stores.search_by_manager(params[:search_manager])

    case params[:status_filter]
    when "active"
      @stores = @stores.active
    when "inactive"
      @stores = @stores.inactive
    end

    @stores = @stores.order(:name)

SELECT `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
---
  def set_store
    @store = Store.find(params[:id])